In [7]:
import pandas as pd

- 연습문제

1. csv폴더 안에 있는 'Sales Records.csv' 파일 로드 
2. 'Order ID', 'Total Revenue', 'Total Cost', 'Total Profit', 'Order Priority' 컬럼을 제거 
3. 컬럼의 이름 변경 : ['대륙', '국가', '상품종류', '판매채널', '주문일자', '발송일자', '판매개수', '단가', '원가']
4. 대륙, 국가를 기준으로 오름차순 정렬
5. 파생변수 생성
    - 총단가 -> 판매개수 * 단가
    - 총원가 -> 판매개수 * 원가 
    - 총이윤 -> 총단가 - 총원가

In [8]:
# 파일을 로드 
sales = pd.read_csv("../../csv/Sales Records.csv")

In [9]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Region          10000 non-null  object
 1   Country         10000 non-null  object
 2   Item Type       10000 non-null  object
 3   Sales Channel   10000 non-null  object
 4   Order Priority  10000 non-null  object
 5   Order Date      10000 non-null  object
 6   Order ID        10000 non-null  int64
 7   Ship Date       10000 non-null  object
 8   Units Sold      10000 non-null  int64
 9   Unit Price      10000 non-null  float64
 10  Unit Cost       10000 non-null  float64
 11  Total Revenue   10000 non-null  float64
 12  Total Cost      10000 non-null  float64
 13  Total Profit    10000 non-null  float64
dtypes: float64(5), int64(2), object(7)
memory usage: 1.1+ MB

In [10]:
df = sales.copy()

In [11]:
# 특정 컬럼을 제거 
# drop()
df.drop([
    'Order ID', 'Total Revenue', 'Total Cost', 'Total Profit', 
    'Order Priority'
], axis = 'columns', inplace=True)

In [12]:
# 컬럼의 이름 변경 
df.columns = ['대륙', '국가', '상품종류', '판매채널', '주문일자', 
'발송일자', '판매개수', '단가', '원가']

In [13]:
df.head(1)

,대륙,국가,상품종류,판매채널,주문일자,발송일자,판매개수,단가,원가
0,Sub-Saharan Africa,Chad,Office Supplies,Online,1/27/2011,2/12/2011,4484,651.21,524.96

In [14]:
# 정렬을 변경 : 대륙, 국가
# 오름차순
# df.sort_values('대륙', inplace = True)
# df.sort_values('국가', inplace = True)
df.sort_values( ['대륙', '국가'], inplace=True )
df.head()

,대륙,국가,상품종류,판매채널,주문일자,발송일자,판매개수,단가,원가
36,Asia,Bangladesh,Personal Care,Online,12/11/2016,1/13/2017,9420,81.73,56.67
246,Asia,Bangladesh,Cosmetics,Offline,7/29/2010,9/11/2010,577,437.20,263.33
446,Asia,Bangladesh,Vegetables,Offline,4/28/2014,5/5/2014,34,154.06,90.93
569,Asia,Bangladesh,Cereal,Offline,6/22/2010,6/28/2010,9768,205.70,117.11
576,Asia,Bangladesh,Office Supplies,Online,3/20/2013,4/11/2013,7731,651.21,524.96

In [15]:
# 총단가(Series) = 판매개수(Seires) * 단가(Series)

df['총단가'] = df['판매개수'] * df['단가']
df['총원가'] = df['판매개수'] * df['원가']
df['총이윤'] = df['총단가'] - df['총원가']

In [16]:
df.head()

,대륙,국가,상품종류,판매채널,주문일자,발송일자,판매개수,단가,원가,총단가,총원가,총이윤
36,Asia,Bangladesh,Personal Care,Online,12/11/2016,1/13/2017,9420,81.73,56.67,769896.60,533831.40,236065.20
246,Asia,Bangladesh,Cosmetics,Offline,7/29/2010,9/11/2010,577,437.20,263.33,252264.40,151941.41,100322.99
446,Asia,Bangladesh,Vegetables,Offline,4/28/2014,5/5/2014,34,154.06,90.93,5238.04,3091.62,2146.42
569,Asia,Bangladesh,Cereal,Offline,6/22/2010,6/28/2010,9768,205.70,117.11,2009277.60,1143930.48,865347.12
576,Asia,Bangladesh,Office Supplies,Online,3/20/2013,4/11/2013,7731,651.21,524.96,5034504.51,4058465.76,976038.75

In [17]:
# 총 이윤의 합계가 가장 높은 국가는 어디인가?
# 국가별로 데이터프레임을 나눠주는 작업 
# 그룹화 함수 groupby()
# df[['국가', '총이윤']].groupby('국가').sum()
group_data = df.groupby('국가')[['총이윤']].sum()

In [18]:
# 총이윤이 가장 높은 10개의 국가를 출력
group_data.sort_values('총이윤', ascending=False).head(10)

                    총이윤
국가
Kiribati    32454798.26
Qatar       30861356.79
Grenada     30302769.90
Taiwan      30044779.98
Malawi      29329125.05
Botswana    29019726.67
Bangladesh  28092720.77
Lithuania   28063374.02
Burundi     27911293.45
Ireland     27807805.05

In [19]:
# 해당하는 데이터에서 South Korea의 순위는 몇위인가?
# 그룹데이터를 총이윤을 기준으로 내림차순 정렬
group_data.sort_values('총이윤', ascending=False, inplace=True)

In [20]:
result = 0
for i in group_data.index:
    # print(i)
    # break
    result += 1
    if i == 'South Korea':
        break
print(result)

48

In [21]:
list(group_data.index).index('South Korea') + 1

48

In [22]:
# group_data에서 인덱스를 초기화하고 기존의 인덱스를 컬럼으로 유지
group_data2 = group_data.reset_index()
group_data2.loc[ group_data2['국가'] == 'South Korea' ]

             국가          총이윤
47  South Korea  23893933.75

In [23]:
# rank() 함수를 이용 
group_data['rank'] = group_data['총이윤'].rank(ascending= False)

In [24]:
group_data.loc[ ['South Korea'] ]

                     총이윤  rank
국가
South Korea  23893933.75  48.0

In [ ]:
df[['국가', '총이윤']].groupby('국가').get_group('South Korea')

In [27]:
# df에서 대륙, 국가 기준으로 그룹화 
group_data3 = df.groupby(['대륙', '국가'])[['총이윤']].sum()

In [ ]:
group_data3.index

In [30]:
group_data3.loc['Asia'].loc['South Korea']

총이윤    23893933.75
Name: South Korea, dtype: float64

In [31]:
group_data3.loc[('Asia', 'South Korea')]

총이윤    23893933.75
Name: (Asia, South Korea), dtype: float64

In [ ]:
# stack() // unstack()
# stack() : 컬럼의 기준들을 인덱스로 내려서 데이터프레임 변환환
group_data3.stack()

In [ ]:
group_data3.unstack()

In [39]:
df.groupby(['대륙', '국가'])[['총이윤']].agg(['mean', 'sum'])

                                         총이윤
                                        mean          sum
대륙                 국가
Asia               Bangladesh  445916.202698  28092720.77
                   Bhutan      425603.022143  23833769.24
                   Brunei      451033.195745  21198560.20
                   Cambodia    359760.043788  23744162.89
                   China       457555.846667  24708015.72
...                                      ...          ...
Sub-Saharan Africa The Gambia  416338.071591  18318875.15
                   Togo        351342.740000  20026536.18
                   Uganda      471648.278364  25940655.31
                   Zambia      393957.550000  23637453.00
                   Zimbabwe    358892.063729  21174631.76

[185 rows x 2 columns]

In [ ]:
pd.pivot_table(
    df, 
    index = ['대륙', '국가'], 
    columns = '상품종류', 
    values = '총이윤', 
    aggfunc= ['sum', 'mean']
)

In [47]:
df.pivot_table(
    index= ['대륙', '국가'], 
    columns='상품종류', 
    values = '총이윤', 
    aggfunc = 'sum'
)

상품종류                            Baby Food  Beverages      Cereal     Clothes  \
대륙                 국가
Asia               Bangladesh   616571.52   61997.94  6008793.93  1159837.92
                   Bhutan      2604036.90  108179.28  2794925.91  3436992.00
                   Brunei      2404072.94  260331.84  2471040.87  1625006.88
                   Cambodia    1511424.62  385142.04  2237517.63  2781540.00
                   China       4285517.16  486759.78  1424438.61  1131049.44
...                                   ...        ...         ...         ...
Sub-Saharan Africa The Gambia  3548545.48  198600.12  1530126.48  1371051.36
                   Togo        2473188.00  544921.02  3047496.00  1638740.16
                   Uganda      2967250.44  696259.26  3426572.61  1613256.48
                   Zambia      4973791.96  153859.50  1939057.92  1195750.08
                   Zimbabwe    2146017.82  488607.66  3068580.42  2370496.32

상품종류                            Cosmetics     Fruits   Household       Meat  \
대륙                 국가
Asia               Bangladesh  4524966.75   56837.44  5182708.56  1794535.6
                   Bhutan      4171315.17   66246.08  5093711.55   887343.6
                   Brunei      2356807.85    9331.52  4576302.49  1316458.0
                   Cambodia    4737957.50   17342.36  2669081.65  2238407.6
                   China       8310812.13   32891.68  2180675.34   464635.6
...                                   ...        ...         ...        ...
Sub-Saharan Africa The Gambia  2511204.41   64686.81  4174241.51   776146.8
                   Togo        3585547.14    8360.29  3278470.86  1001858.0
                   Uganda      7794244.36   64412.07  2980488.32   985842.0
                   Zambia      3845135.05   84123.46  4032873.82  1366279.2
                   Zimbabwe    4989895.13  156295.73  1695086.44   551408.0

상품종류                           Office Supplies  Personal Care      Snacks  \
대륙                 국가
Asia               Bangladesh       4340222.50      732654.16  1686677.46
                   Bhutan           1150642.50      461580.14  1072031.88
                   Brunei           3895696.25       19872.58  1051795.50
                   Cambodia         3767300.00     1055276.60  1114599.96
                   China            3854412.50      898952.32   544838.34
...                                        ...            ...         ...
Sub-Saharan Africa The Gambia       2522853.75      353847.20   577370.94
                   Togo             3025960.00       62800.36   534527.16
                   Uganda           3830930.00      295407.28   117393.06
                   Zambia           3908573.75      588133.14  1549875.12
                   Zimbabwe         2202683.75      463058.68   899553.96

상품종류                           Vegetables
대륙                 국가
Asia               Bangladesh  1926916.99
                   Bhutan      1986764.23
                   Brunei      1211843.48
                   Cambodia    1228572.93
                   China       1093032.82
...                                   ...
Sub-Saharan Africa The Gambia   690200.29
                   Togo         824667.19
                   Uganda      1168599.43
                   Zambia             NaN
                   Zimbabwe    2142947.85

[185 rows x 12 columns]

In [ ]:
df.groupby(['대륙', '국가', '상품종류'])[['총이윤']].sum().unstack()

In [52]:
pivot_data = df.pivot_table(
    index = ['대륙', '국가'], 
    columns= '상품종류', 
    values= '총이윤', 
    aggfunc= ['sum', 'mean']
)

In [62]:
# pivot_data에서 South Korea의 Clothes 상품의 총이윤 합계의 값을 출력
pivot_data.loc['Asia'].loc['South Korea'].loc['sum'].loc['Clothes']

985197.6

In [66]:
pivot_data['sum']['Clothes']['Asia']['South Korea']

985197.6

In [71]:
pivot_data.loc[ ('Asia', 'South Korea'), ('sum', 'Clothes') ]

985197.6